benchmarks/http_suite_20260323_141050/wrk_ping_io4_c256.wrk.out
Running 5s test @ http://127.0.0.1:18080/ping
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.52ms    1.95ms  34.64ms   76.21%
    Req/Sec     5.83k     0.89k   17.18k    96.27%
  Latency Distribution
     50%    4.97ms
     75%    6.02ms
     90%    8.67ms
     99%   11.09ms
  233052 requests in 5.10s, 25.56MB read
Requests/sec:  45692.67
Transfer/sec:      5.01MB